
Процедура ПриСозданииНаСервере(Форма) Экспорт 
	
	// ++ Ржевская ___ 23.10.2026: Добавление реквизита формы "Контактое лицо"
	
	Элементы = Форма.Элементы;
	//Создадим группу для реквизитов Согласованная скидка и команды пересчета таблицы. 
	Группа = Элементы.Добавить("ГруппаСкидкаИТаблица", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛево);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	//
	ДобавитьРеквизитПрограммно = Элементы.Добавить("Net_КонтактноеЛицо", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);
	ДобавитьРеквизитПрограммно.ПутьКДанным = "Объект.Net_КонтактноеЛицо";
	ДобавитьРеквизитПрограммно.Вид = ВидПоляФормы.ПолеВвода; 

	// -- Ржевская

КонецПроцедуры