
Процедура ПриСозданииНаСервере(Форма) Экспорт
	
// ++ Ржевская ___ 11.10.2026: Добавление реквизита формы "Контактое лицо"
	
	Элементы = Форма.Элементы;
	//Создадим группу для реквизитов Согласованная скидка и команды пересчета таблицы. 
	Группа = Элементы.Добавить("ГруппаСкидкаИТаблица", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛево);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	
	
	ДобавитьРеквизитПрограммно = Элементы.Добавить("Net_КонтактноеЛицо", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);
	ДобавитьРеквизитПрограммно.ПутьКДанным = "Объект.Net_КонтактноеЛицо";
	ДобавитьРеквизитПрограммно.Вид = ВидПоляФормы.ПолеВвода;
	
	//Создаем массив для добавления нового реквизита
	ДобавляемыеРеквизиты = Новый Массив; 
	НовыйРеквизит = Новый РеквизитФормы("Net_СогласованнаяСкидка", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5,2, ДопустимыйЗнак.Неотрицательный)));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	
	СкидкаЭлемент = Элементы.Добавить("Net_СогласованнаяСкидка", Тип("ПолеФормы"), Группа);	
	СкидкаЭлемент.ПутьКДанным = "Объект.Net_СогласованнаяСкидка"; 
	СкидкаЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	СкидкаЭлемент.Заголовок = "Согласованная скидка";
	СкидкаЭлемент.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении"); //Добавлен код для создания действия
	
	//Создание команды и кнопки ПересчитатьТаблицу 
	КомандаПересчитатьТаблицу = Форма.Команды.Добавить("ПересчитатьТаблицу");
	КомандаПересчитатьТаблицу.Заголовок = "Пересчитать таблицу"; 
	КомандаПересчитатьТаблицу.Действие = "ПересчитатьТаблицу"; 
	
	КнопкаКоманды = Элементы.Добавить("ПересчитатьТаблицу", Тип("КнопкаФормы"), Группа);
	КнопкаКоманды.ИмяКоманды = "ПересчитатьТаблицу";
	КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	// Теперь задаём картинку
	КнопкаКоманды.Картинка = БиблиотекаКартинок.Обновить;	
	КнопкаКоманды.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	// -- Ржевская
	
КонецПроцедуры